---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditDeletedElements
source: html/3c1dd101-57cd-d6ea-7e23-a81e0d5e45da.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotEditDeletedElements Property

Can't edit the element. It was deleted in the Central Model.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotEditDeletedElements { get; }
```